Mengimport library pandas

In [1]:
import pandas as pd

Membaca dataset csv dan memasukkan ke dalam variabel dataset

In [2]:
dataset = pd.read_csv('Airlines.csv')

Tampilkan rata-rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, dan Q3 dari attribute bertipe angka.

In [3]:
dataset.describe()

,id,Flight,DayOfWeek,Time,Length,Delay
count,539383.000000,539383.000000,539383.000000,539383.000000,539383.000000,539383.000000
mean,269692.000000,2427.928630,3.929668,802.728963,132.202007,0.445442
std,155706.604461,2067.429837,1.914664,278.045911,70.117016,0.497015
min,1.000000,1.000000,1.000000,10.000000,0.000000,0.000000
25%,134846.500000,712.000000,2.000000,565.000000,81.000000,0.000000
50%,269692.000000,1809.000000,4.000000,795.000000,115.000000,0.000000
75%,404537.500000,3745.000000,5.000000,1035.000000,162.000000,1.000000
max,539383.000000,7814.000000,7.000000,1439.000000,655.000000,1.000000

Tampilkan 10 record pertama dari dataset dengan attribute bertipe angka.

Pertama memilah isi dataset dengan hanya menampilkan tipe data number

In [4]:
datasetangka = dataset.select_dtypes(include=['number'])

Kedua, tampilkan 10 record pertama dari dataset dengan attribute bertipe angka.

In [5]:
datasetangka.head(10)

   id  Flight  DayOfWeek  Time  Length  Delay
0   1     269          3    15     205      1
1   2    1558          3    15     222      1
2   3    2400          3    20     165      1
3   4    2466          3    20     195      1
4   5     108          3    30     202      0
5   6    1094          3    30     181      1
6   7    1768          3    30     220      0
7   8    2722          3    30     228      0
8   9    2606          3    35     216      1
9  10    2538          3    40     200      1

Tampilkan informasi jumlah record, jumlah attribute, nama attribute, jumlah attribute dengan tipe angka. Masukkan informasi tersebut dalam dictionary dengan key sesuai nama informasinya. Tampilkan isi dari dictionary tersebut sebagus mungkin.

Mengambil jumlah record dan jumlah attribute dari dataset.shape()

In [31]:
jumlah_record, jumlah_attribute = dataset.shape

Mengambil nama-nama kolom attribute

In [32]:
nama_attribute = dataset.columns.tolist()

Menghitung jumlah kolom dengan tipe data angka

In [8]:

jumlah_attribute_angka = len(dataset.select_dtypes(include=['number']).columns)

Membuat dictionary dengan informasi yang diperlukan

In [35]:
informasi_dataset = {
    "Jumlah Record                      ": jumlah_record,
    "Jumlah Attribute                   ": jumlah_attribute,
    "Nama Attribute                     ": nama_attribute,
    "Jumlah Attribute dengan Tipe Angka ": jumlah_attribute_angka
}

Menampilkan isi dictionary

In [36]:
for key, value in informasi_dataset.items():
    print(f"{key}: {value}")

Jumlah Record                      : 539383
Jumlah Attribute                   : 9
Nama Attribute                     : ['id', 'Airline', 'Flight', 'AirportFrom', 'AirportTo', 'DayOfWeek', 'Time', 'Length', 'Delay']
Jumlah Attribute dengan Tipe Angka : 6

Tampilkan nilai dataset pada baris dimulai dengan 3 digit NIM akhir hingga data terakhir dan kolom ke 4 hingga kolom terakhir menggunakan ke 2 metode slice.

NIM 099

Menggunakan slicing loc

In [38]:

dataset.loc[99:, dataset.columns[3]:]

       AirportFrom AirportTo  DayOfWeek  Time  Length  Delay
99             BTV       IAD          3   336     110      0
100            TLH       ATL          3   338      68      0
101            TYS       ATL          3   340      57      0
102            DFW       IAH          3   340      59      1
103            BOS       DTW          3   340     144      0
...            ...       ...        ...   ...     ...    ...
539378         OGG       SNA          5  1439     326      0
539379         SEA       ATL          5  1439     305      0
539380         SFO       MKE          5  1439     255      0
539381         HNL       SFO          5  1439     313      1
539382         LAX       PHL          5  1439     301      1

[539284 rows x 6 columns]

Menggunkan slicing iloc

In [37]:
dataset.iloc[99:, 3:]

       AirportFrom AirportTo  DayOfWeek  Time  Length  Delay
99             BTV       IAD          3   336     110      0
100            TLH       ATL          3   338      68      0
101            TYS       ATL          3   340      57      0
102            DFW       IAH          3   340      59      1
103            BOS       DTW          3   340     144      0
...            ...       ...        ...   ...     ...    ...
539378         OGG       SNA          5  1439     326      0
539379         SEA       ATL          5  1439     305      0
539380         SFO       MKE          5  1439     255      0
539381         HNL       SFO          5  1439     313      1
539382         LAX       PHL          5  1439     301      1

[539284 rows x 6 columns]

Tampilkan jumlah label dari semua attribute yang bernilai object (contoh : Jenis Kelamin, Agama).

Menampilkan tipe data pada dataset

In [25]:
dataset.dtypes

id              int64
Airline        object
Flight          int64
AirportFrom    object
AirportTo      object
DayOfWeek       int64
Time            int64
Length          int64
Delay           int64
dtype: object

Anda dapat mengambil kolom dengan tipe data objek

In [39]:
kolom_objek = dataset.select_dtypes(include=['object'])

Membuat dictionary untuk menyimpan jumlah label unik untuk setiap kolom objek

In [40]:
jumlah_label = {}

Loop melalui setiap kolom objek dan menghitung jumlah label unik

In [43]:

for kolom in kolom_objek.columns:
    jumlah_label[kolom] = len(dataset[kolom].unique())

Menampilkan jumlah label unik untuk setiap kolom objek

In [44]:
for kolom, jumlah in jumlah_label.items():
    print(f"{kolom}: {jumlah} label unik")

Airline: 18 label unik
AirportFrom: 293 label unik
AirportTo: 293 label unik